# text_list = [
#     "禅智内供《ぜんちないぐ》の鼻と云えば、池《いけ》の尾《お》で知らない者はない。長さは五六寸あって上唇《うわくちびる》の上から顋《あご》の下まで下っている。形は元も先も同じように太い。云わば細長い腸詰《ちょうづ》めのような物が、ぶらりと顔のまん中からぶら下っているのである",
#     "五十歳を越えた内供は、沙弥《しゃみ》の昔から、内道場供奉《ないどうじょうぐぶ》の職に陞《のぼ》った今日《こんにち》まで、内心では始終この鼻を苦に病んで来た。勿論《もちろん》表面では、今でもさほど気にならないような顔をしてすましている。これは専念に当来《とうらい》の浄土《じょうど》を渇仰《かつぎょう》すべき僧侶《そうりょ》の身で、鼻の心配をするのが悪いと思ったからばかりではない。それよりむしろ、自分で鼻を気にしていると云う事を、人に知られるのが嫌だったからである。内供は日常の談話の中に、鼻と云う語が出て来るのを何よりも惧《おそ》れていた。",
#     "内供が鼻を持てあました理由は二つある。――一つは実際的に、鼻の長いのが不便だったからである。第一飯を食う時にも独りでは食えない。独りで食えば、鼻の先が鋺《かなまり》の中の飯へとどいてしまう。そこで内供は弟子の一人を膳の向うへ坐らせて、飯を食う間中、広さ一寸長さ二尺ばかりの板で、鼻を持上げていて貰う事にした。しかしこうして飯を食うと云う事は、持上げている弟子にとっても、持上げられている内供にとっても、決して容易な事ではない。一度この弟子の代りをした中童子《ちゅうどうじ》が、嚏《くさめ》をした拍子に手がふるえて、鼻を粥《かゆ》の中へ落した話は、当時京都まで喧伝《けんでん》された。――けれどもこれは内供にとって、決して鼻を苦に病んだ重《おも》な理由ではない。内供は実にこの鼻によって傷つけられる自尊心のために苦しんだのである。"
#     ]

text_list = {
    "video.mp4" : [ 
        "1禅智内供《ぜんちないぐ》\nの鼻と云えば、**池《いけ》の尾** 《お》で知らない者はない。長さは五六寸あって上唇《うわくちびる》の上から顋《あご》の下まで下っている。形は元も先も同じように太い。云わば細長い腸詰《ちょうづ》めのような物が、ぶらりと顔のまん中からぶら下っているのである",
        "2五十歳を越えた内供は、沙弥《しゃみ》の昔から、内道場供奉《ないどうじょうぐぶ》の職に陞《のぼ》った今日《こんにち》まで、内心では始終この鼻を苦に病んで来た。勿論《もちろん》表面では、今でもさほど気にならないような顔をしてすましている。これは専念に当来《とうらい》の浄土《じょうど》を渇仰《かつぎょう》すべき僧侶《そうりょ》の身で、鼻の心配をするのが悪いと思ったからばかりではない。それよりむしろ、自分で鼻を気にしていると云う事を、人に知られるのが嫌だったからである。内供は日常の談話の中に、鼻と云う語が出て来るのを何よりも惧《おそ》れていた。",
        "3内供が鼻を持てあました理由は二つある。――一つは実際的に、鼻の長いのが不便だったからである。第一飯を食う時にも独りでは食えない。独りで食えば、鼻の先が鋺《かなまり》の中の飯へとどいてしまう。そこで内供は弟子の一人を膳の向うへ坐らせて、飯を食う間中、広さ一寸長さ二尺ばかりの板で、鼻を持上げていて貰う事にした。しかしこうして飯を食うと云う事は、持上げている弟子にとっても、持上げられている内供にとっても、決して容易な事ではない。一度この弟子の代りをした中童子《ちゅうどうじ》が、嚏《くさめ》をした拍子に手がふるえて、鼻を粥《かゆ》の中へ落した話は、当時京都まで喧伝《けんでん》された。――けれどもこれは内供にとって、決して鼻を苦に病んだ重《おも》な理由ではない。内供は実にこの鼻によって傷つけられる自尊心のために苦しんだのである。"
        ],
    "video2.mp4" : [
        "one《あご》の下まで下っている。形は元も先も同じように太い。云わば細長い腸詰《ちょうづ》めのような物が、ぶらりと顔のまん中からぶら下っているのである",
        "twoうじょうぐぶ》の職に陞《のぼ》った今日《こんにち》まで、内心では始終この鼻を苦に病んで来た。勿論《もちろん》表面では、今でもさほど気にならないような顔をしてすましている。これは専念に当来《とうらい》の浄土《じょうど》を渇仰《かつぎょう》すべき僧侶《そうりょ》の身で、鼻の心配をするのが悪いと思ったからばかりではない。それよりむしろ、自分で鼻を気にしていると云う事を、人に知られるのが嫌だったからである。内供は日常の談話の中に、鼻と云う語が出て来るのを何よりも惧《おそ》れていた。",
        "three内供が鼻を持てあました理由は二つ"
    ] 
    }

video_list = [
    "video.mp4",
    "video2.mp4"
]

text_detail = [
    "①詳細\n②詳細",
    "①詳細\n②詳細"
]